ESB/gsb_igov_notification_brokerFlow/notification.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v1="urn:igov.gov.qa/sharedServices/notification/specifications/v1_0/"
	xmlns:v11="urn:igov.gov.qa/xml/schemas/v1_0/"
	xmlns:v12="urn:igov.gov.qa/sharedServices/notification/xml/schemas/v1_0/">
	<soapenv:Header>
		<v1:IGOVHeader>
			<v11:SenderInfo>
				<!--Optional:-->
				<v11:TrackingID>?</v11:TrackingID>
				<v11:ApplicationID>?</v11:ApplicationID>
				<v11:UID>?</v11:UID>
			</v11:SenderInfo>
			<v11:MEP>?</v11:MEP>
			<!--Optional:-->
			<v11:QOS>?</v11:QOS>
			<!--Optional:-->
			<v11:Key>?</v11:Key>
			<!--Optional:-->
			<v11:DataMode>?</v11:DataMode>
			<v11:RunMode>?</v11:RunMode>
			<!--Optional:-->
			<v11:TrackingID>?</v11:TrackingID>
			<!--Optional:-->
			<v11:TraceResults>
				<!--Zero or more repetitions:-->
				<v11:TraceResult>
					<v11:IPAddress>?</v11:IPAddress>
					<v11:Instance>?</v11:Instance>
					<v11:Actor>?</v11:Actor>
					<v11:Timestamp>?</v11:Timestamp>
					<!--Optional:-->
					<v11:DetailedMessage>?</v11:DetailedMessage>
				</v11:TraceResult>
			</v11:TraceResults>
			<!--Optional:-->
			<v11:TraceSettings enabled="false" />
		</v1:IGOVHeader>
	</soapenv:Header>
	<soapenv:Body>
		<v1:NotificationsendNotificationRequest1>
			<v1:sendNotification>
				<!--1 to 100 repetitions:-->
				<v12:notificationMessage>
					<v12:emailDetails>
						<v12:sender>islam.azaz@gmail.com</v12:sender>
						<v12:recipient>
							islam.azaz@gmail.com
						</v12:recipient>
						<v12:subject>رسالة هامة</v12:subject>
						<v12:message>يا هادى يا رب</v12:message>
					</v12:emailDetails>
				</v12:notificationMessage>
				<v12:notificationMessage>
					<v12:emailDetails>
						<v12:sender>email</v12:sender>
						<v12:recipient>?</v12:recipient>
						<v12:subject>2</v12:subject>
						<v12:message>2</v12:message>
					</v12:emailDetails>
				</v12:notificationMessage>
				<v12:notificationMessage>
					<v12:smsDetails>
						<v12:mobileNumber>1</v12:mobileNumber>
						<v12:message>3</v12:message>
						<v12:messageLanguage>sms</v12:messageLanguage>
					</v12:smsDetails>
				</v12:notificationMessage>
				<v12:notificationMessage>
					<v12:emailDetails>
						<v12:sender>email</v12:sender>
						<v12:recipient>?</v12:recipient>
						<v12:subject>4</v12:subject>
						<v12:message>4</v12:message>
					</v12:emailDetails>
				</v12:notificationMessage>
				<v12:notificationMessage>
					<v12:smsDetails>
						<v12:mobileNumber>1</v12:mobileNumber>
						<v12:message>5</v12:message>
						<v12:messageLanguage>sms</v12:messageLanguage>
					</v12:smsDetails>
				</v12:notificationMessage>
			</v1:sendNotification>
		</v1:NotificationsendNotificationRequest1>
	</soapenv:Body>
</soapenv:Envelope>